In [1]:
import pandas as pd

In [75]:
df1= pd.read_csv("fe_binning.csv")

In [76]:
df1.head(10)

       country  happiness
0  Afghanistan   3.982855
1      Albania   4.606651
2    Argentina   6.697131
3      Armenia   4.348320
4    Australia   7.309061
5      Austria   7.076447
6   Azerbaijan   5.146775
7      Bahrain   6.007375
8   Bangladesh   4.633474
9      Belarus   5.718908

In [77]:
df1.describe()

        happiness
count  143.000000
mean     5.404037
std      1.116106
min      2.701591
25%      4.614304
50%      5.344383
75%      6.279204
max      7.603434

In [78]:
# Allocate happiness to bins
binned = pd.cut(df["happiness"], bins = [0, 4.5, 6, 8], labels = ["L","M","H"])

# Add the binned values as a new categorical feature
df1["happiness_band"] = binned

In [79]:
df1.head(10)

       country  happiness happiness_band
0  Afghanistan   3.982855              L
1      Albania   4.606651              M
2    Argentina   6.697131              H
3      Armenia   4.348320              L
4    Australia   7.309061              H
5      Austria   7.076447              H
6   Azerbaijan   5.146775              M
7      Bahrain   6.007375              H
8   Bangladesh   4.633474              M
9      Belarus   5.718908              M

In [80]:
df1["happiness_band"].value_counts()

M    68
H    44
L    31
Name: happiness_band, dtype: int64

In [81]:
mapping=pd.read_csv("country_region.csv")
mapping.head()

          country                      region
0     Afghanistan                  South Asia
1         Albania       Europe & Central Asia
2         Algeria  Middle East & North Africa
3  American Samoa         East Asia & Pacific
4         Andorra       Europe & Central Asia

In [82]:
# Merge the mapping table onto the main table, using the country as the key
df1 = pd.merge(df1, mapping, left_on='country', right_on='country', how="left",suffixes=0)

C:\Users\minhd\AppData\Local\Temp\ipykernel_16500\430124974.py:2: FutureWarning: Passing 'suffixes' as a <class 'int'>, is not supported and may give unexpected results. Provide 'suffixes' as a tuple instead. In the future a 'TypeError' will be raised.
  df1 = pd.merge(df1, mapping, left_on='country', right_on='country', how="left",suffixes=0)

In [83]:
df1.head()

       country  happiness happiness_band                     region
0  Afghanistan   3.982855              L                 South Asia
1      Albania   4.606651              M      Europe & Central Asia
2    Argentina   6.697131              H  Latin America & Caribbean
3      Armenia   4.348320              L      Europe & Central Asia
4    Australia   7.309061              H        East Asia & Pacific

In [84]:
#check for nulls
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 143 entries, 0 to 142
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   country         143 non-null    object
 1   happiness       143 non-null    float64
 2   happiness_band  143 non-null    category
 3   region          143 non-null    object
dtypes: category(1), float64(1), object(2)
memory usage: 4.7+ KB

In [85]:
# Check for nulls
df1[df1.region.isnull()]

Empty DataFrame
Columns: [country, happiness, happiness_band, region]
Index: []